week_11/day_2/TodoList/app/controllers/api/todos_controller.rb

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "todo4"], ["body", "todo4 body"], ["done", false], ["created_at", "2021-11-12 00:45:37.054844"], ["updated_at", "2021-11-12 00:45:37.054844"]]