week_6/day_3/first_routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "rails olympics"], ["updated_at", "2021-10-07 21:36:29.514309"], ["id", 4]]
---
  def update
    artwork = Artwork.find(params[:id])
    artwork.update(artwork_params)